var gamevars_ru = {
    banner: [
        '<span class="index">© ShellSaga, Все права защищены.</span>',
        "   _____            _ _ _____                   ",
        "  /  ___| |        | | /  ___|                  ",
        "  \\ `--.| |__   ___| | \\ `--.  __ _  __ _  __ _ ",
        "   `--. \\ '_ \\ / _ \\ | |`--. \\/ _` |/ _` |/ _` |",
        "  /\\__/ / | | |  __/ | /\\__/ / (_| | (_| | (_| |",
        "  \\____/|_| |_|\\___|_|_\\____/ \\__,_|\\__, |\\__,_|",
        "                                     __/ |      ",
        "                                    |___/       ",
        "                                          © 2024",
    ],
    mobileBanner: [
        '<span class="index">© ShellSaga, Все права защищены.</span>',
        "<br>",
    ],
    welcomeLetter: [
        'Добро пожаловать! Если вы новичок в игре, вот несколько советов:',
        "<br>",
        'Осмотрите свои окрестности с помощью команды "<span class="command">ls</span>"',
        'Переместитесь в новое местоположение с командой "<span class="command">cd МЕСТО</span>"',
        'Вы можете вернуться назад с помощью команды "<span class="command">cd ..</span>"',
        'Взаимодействуйте с объектами в мире с помощью команды "<span class="command">less ПРЕДМЕТ</span>"',
        "<br>",
        'Если вы забыли, где находитесь, введите "<span class="command">pwd</span>"',
        "<br>",
        'Итак, исследуйте. Надеюсь, вам понравится то, что вы найдете. Сделайте <span class="command">ls</span> вашей первой командой',
        "<br>",
    ],
    homeMoveMessage: "Вы переместились в Дом. Вы находитесь в уюте своего дома.",
    locationsString: "Места:",
    itemsString: "Предметы:",
    rootString: "Вы пришли домой!",
    firstRoomString: "Вы в первой комнате. ",
    noLocationString: "Поблизости нет локации ",
    commandString: "Команда",
    notFoundString: "не найдена",
    whereString: "Вы в ",
    noItemString: "Нет ",
    hereString: " здесь",
    noLessString: "Выберите другой предмет для осмотра.",
    nothingInterestingString: "Ничего интересного не происходит.",
    moveErrorString: "Нужно передвинуть вещь А в вещь Б. Используйте mv [вещьA] [вещьБ].",
    mustBeValidString: "Должен быть существующей вещью или местом для передвижения.",
    moveString: "Передвинул ",
    toString: " в ",
    youreTooBig: "Вы слишком велики, что бы вместиться сюда.",
    gardenMoveMessage: [
        "Когда вы входите в сад, вас встречает успокаивающий аромат",
        "цветущих тюльпанов. Бабушка старательно ухаживает за растениями,",
        "ее обветренные руки заботливо ухаживают за каждым из них. Яркие",
        "цвета флоры контрастируют с деревенским очарованием окружающей обстановки.",
        "За бабушкой вы замечаете тропинку, ведущую к теплице,",
        "обещаюшей секреты природы за стеклом."
    ],
    yardMoveMessage: "Вы во дворе.",
    grandmaInteractMessage: [
        "Бабушка поднимает глаза от своей работы и тепло улыбается,",
        "Ее глаза морщатся в уголках. Она нежно похлопывает вас по плечу.",
        "и говорит: 'Я занята, дорогой внучок. Пойди помоги своему дедушке",
        "в теплице. У него может быть для тебя задание.'"
    ],
    greenhouseMoveMessage: [
        "Как только вы входите в теплицу, вас окутывает волна тепла и влажности.",
        "Ряды процветающих растений простираются перед вами, их листья блестят",
        "росой. Дедушка тщательно осматривает каждое растение, в руках у него секатор.",
        "Воздух наполнен землистым ароматом почвы и сладким запахом расцветающих цветов.",
        "Стол для работы забит садовыми инструментами и пакетами семян.",
        "Здесь царит чувство роста и жизни в этом маленьком зеленом убежище."
    ],
    potatoMessage: "Это картошка.",
    grandpaInteractMessageTask: [
        "Дедушка поднимает глаза от садоводства, его глаза сверкают предвкушением.",
        "'Ах, мой умный внук! У меня есть для тебя задание,' - восклицает он.",
        "'Видишь те картошки там - Potato1, Potato2 и Potato3?'",
        "'Мне нужно, чтобы ты переместил каждую из них в Ящик используя команду <span class=\"command\">mv [картошка] Crate</span>.'",
        "'Попробуй, и скажи мне, когда закончишь.'"
    ],
    grandpaInteractMessageReminder: [
        "Дедушка оглядывается, на лице появляется легкая гримаса.",
        "'Ты хорошо справляешься, дорогой, но еще есть несколько картошек,",
        "которые должны попасть в Ящик. Не забудь использовать",
        "команду <span class=\"command\">mv [картошка] Crate</span> для каждой из них.'"
    ],
    grandpaInteractMessageThanks: [
        "Когда вы успешно перемещаете последнюю картошку в Ящик,",
        "лицо дедушки светится удовлетворением. 'Спасибо, мой",
        "трудолюбивый внук! Теперь я могу продолжить свою работу с легкостью.'",
        "Он благодарно кивает вам и возвращается к садоводческим делам."
    ],
    grandpaInteractMessageDone: "Ты хорошо справился с картошками, спасибо!",
    roadSign: [
        "Магазин - 200м",
        "Шоссе - 1км",
    ],
    roadMoveMessage: [
        // I'm hella tired rn, good description will come tomorrow (i hope)
        "Вы передвигаетесь на дорогу и видите табличку.",
    ],
    storeMoveMessage: [
        "Вы в магазине.",
    ],
    fieldMoveMessage: [
        "Вы на поле. В траве лежит собака.",
    ],
    dog: [
        "Очень милое описание собаки.",
    ],
    highwayMoveMessage: [
        "Выйдя с поля, вы попадаете на шоссе. Недалеко виднеется автобусная остановка.",
    ],
    busStopMoveMessage: [
        "Вы на автобусной остановке. Помимо вас, рядом стоит старый мужчина.",
    ],
    oldManInteractMessage: [
        "Знаешь... Ты можешь испепелять людей командой <span class=\"command\">rm [предмет]</span>...",
    ],
    traderInteractMessageTask: [
        "Молодой человек! Помогите мне разложить помидоры по полкам.",
    ],
    removeString: [
        "Вы стерли ",
    ],
    removeEndString: [
        " с лица земли.",
    ],
    forestPathMoveMessage: [
        "Вы выходите на тропу к лесу, но вход в лес преграждают молодые люди неприятного лица.",
    ],
    bullyMessage: [
        "Ты не пройдешь в лес!",
    ],
    forestMoveMessage: [
        "С облегчением, вы входите в лес.",
    ],
    riverMoveMessage: [
        "А у реки, а у реки, а у реки",
        "Гуляют девки, гуляют мужики...",
    ],
    largeFieldMoveMessage: [
        "Чисто поле и никого!",
    ],
    kanavaMoveMessage: [
        "Канава с бомжом."
    ],
    bridgeMoveMessage: [
        "Похоже мост сломан. Была бы только возможность его починить..."
    ],
};